//#ifndef _BL_H_
//#define _BL_H_


#include "allHead.h"

//加大比例3
//1ms
//对差值P非线性，简单以差值大小对应不同P，/对数关系/通过差值建模糊/通过测速和差值大小或角速度确定P
//速度大，P大，速度小，P小。
//差值小，P小，差值大，P大
//0.5ms
//直道，差值大，刚变成弯道，计时，计时一定时间才减小差值
/*****************************阿克曼角参数2************************************/
//float k=0;//k未定参数，k大能让弯道转弯差速提前，k小转弯差速靠后
//float k3=0.0,k4=0.0;//差值变化率影响系数
//float B=15.5,L=15;//B为后轮间距，L为前后轮间距,B/2L=4/9,15.5/30=0.517
//float angle,angle_2;//小车偏转角度2
//float  speed_temp2=0,speed_temp1=-20;
/********************************************************************************/
//float k;//k未定参数，k大能让弯道转弯差速提前，k小转弯差速靠后
//float k3,k4;//差值变化率影响系数
//float B,L;//B为后轮间距，L为前后轮间距,B/2L=4/9,15.5/30=0.517
//float angle,angle_2;//小车偏转角度2
//float  speed_temp2,speed_temp1;
/********************************************************************************/
